Revit 2024 API
BuiltInFailures.SplitSketchBasedElementFailures.NotSplitValidRegions Property
 The split failed. There may be a gap in the boundary loop or the sketch may be incomplete.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotSplitValidRegions { get; }
Visual Basic
Public Shared ReadOnly Property NotSplitValidRegions As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotSplitValidRegions {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SplitSketchBasedElementFailures Class
Autodesk.Revit.DB Namespace